import {
	Footprints,
	LampCeiling,
	Plug,
	Shirt,
	Home,
	Dumbbell,
	HeartPulse,
} from "lucide-react";

export const categories = [
	{
		label: "Электроника",
		value: "electric",
		icon: Plug,
		href: "/electric",
		subCategories: [
			{
				label: "Телефоны и смарт-часы",
				href: "/",
				links: [
					{
						label: "Смартфоны",
						href: "/",
					},
					{
						label: "Смарт-часы и фитнес-браслеты",
						href: "/",
					},
					{
						label: "Аксессуары для смартфонов и телефонов",
						href: "/",
					},
				],
			},
			{
				label: "Аудиотехника",
				href: "/",
				links: [
					{
						label: "Наушники и гарнитура",
						href: "/",
					},
					{
						label: "Акустика и колонки",
						href: "/",
					},
					{
						label: "Микрофоны и аксессуары",
						href: "/",
					},
				],
			},
			{
				label: "Фото и видеокамеры",
				href: "/",
				links: [
					{
						label: "Экшн-камеры",
						href: "/",
					},
					{
						label: "Объективы",
						href: "/",
					},
					{
						label: "Видеокамеры и аксессуары",
						href: "/",
					},
				],
			},
			{
				label: "Телефоны и смарт-часы",
				href: "/",
				links: [
					{
						label: "Смартфоны",
						href: "/",
					},
					{
						label: "Смарт-часы и фитнес-браслеты",
						href: "/",
					},
					{
						label: "Аксессуары для смартфонов и телефонов",
						href: "/",
					},
				],
			},
			{
				label: "Телефоны и смарт-часы",
				href: "/",
				links: [
					{
						label: "Смартфоны",
						href: "/",
					},
					{
						label: "Смарт-часы и фитнес-браслеты",
						href: "/",
					},
					{
						label: "Аксессуары для смартфонов и телефонов",
						href: "/",
					},
				],
			},
			{
				label: "Телефоны и смарт-часы",
				href: "/",
				links: [
					{
						label: "Смартфоны",
						href: "/",
					},
					{
						label: "Смарт-часы и фитнес-браслеты",
						href: "/",
					},
					{
						label: "Аксессуары для смартфонов и телефонов",
						href: "/",
					},
				],
			},
		],
	},
	{
		label: "Спорт и отдых",
		value: "electric",
		icon: Dumbbell,
		href: "/electric",
		subCategories: [
			{
				label: "Велоспорт",
				href: "/",
				links: [
					{
						label: "BMX",
						href: "/",
					},
					{
						label: "Детские велосипеды",
						href: "/",
					},
					{
						label: "Подростковые велосипеды",
						href: "/",
					},
				],
			},
			{
				label: "Самокаты, скейтборды и эклектротранспорт",
				href: "/",
				links: [
					{
						label: "Наушники и гарнитура",
						href: "/",
					},
					{
						label: "Акустика и колонки",
						href: "/",
					},
					{
						label: "Микрофоны и аксессуары",
						href: "/",
					},
				],
			},
			{
				label: "Бег",
				href: "/",
				links: [
					{
						label: "Экшн-камеры",
						href: "/",
					},
					{
						label: "Объективы",
						href: "/",
					},
					{
						label: "Видеокамеры и аксессуары",
						href: "/",
					},
				],
			},
			{
				label: "Бокс и боевые искусства",
				href: "/",
				links: [
					{
						label: "Смартфоны",
						href: "/",
					},
					{
						label: "Смарт-часы и фитнес-браслеты",
						href: "/",
					},
					{
						label: "Аксессуары для смартфонов и телефонов",
						href: "/",
					},
				],
			},
			{
				label: "Тренажеры и фитнес",
				href: "/",
				links: [
					{
						label: "Смартфоны",
						href: "/",
					},
					{
						label: "Смарт-часы и фитнес-браслеты",
						href: "/",
					},
					{
						label: "Аксессуары для смартфонов и телефонов",
						href: "/",
					},
				],
			},
			{
				label: "Водные виды спорта",
				href: "/",
				links: [
					{
						label: "Смартфоны",
						href: "/",
					},
					{
						label: "Смарт-часы и фитнес-браслеты",
						href: "/",
					},
					{
						label: "Аксессуары для смартфонов и телефонов",
						href: "/",
					},
				],
			},
		],
	},
	{
		label: "Красота и здоровье",
		value: "electric",
		icon: HeartPulse,
		href: "/electric",
		subCategories: [
			{
				label: "Телефоны и смарт-часы",
				href: "/",
				links: [
					{
						label: "Смартфоны",
						href: "/",
					},
					{
						label: "Смарт-часы и фитнес-браслеты",
						href: "/",
					},
					{
						label: "Аксессуары для смартфонов и телефонов",
						href: "/",
					},
				],
			},
			{
				label: "Аудиотехника",
				href: "/",
				links: [
					{
						label: "Наушники и гарнитура",
						href: "/",
					},
					{
						label: "Акустика и колонки",
						href: "/",
					},
					{
						label: "Микрофоны и аксессуары",
						href: "/",
					},
				],
			},
			{
				label: "Фото и видеокамеры",
				href: "/",
				links: [
					{
						label: "Экшн-камеры",
						href: "/",
					},
					{
						label: "Объективы",
						href: "/",
					},
					{
						label: "Видеокамеры и аксессуары",
						href: "/",
					},
				],
			},
			{
				label: "Телефоны и смарт-часы",
				href: "/",
				links: [
					{
						label: "Смартфоны",
						href: "/",
					},
					{
						label: "Смарт-часы и фитнес-браслеты",
						href: "/",
					},
					{
						label: "Аксессуары для смартфонов и телефонов",
						href: "/",
					},
				],
			},
			{
				label: "Телефоны и смарт-часы",
				href: "/",
				links: [
					{
						label: "Смартфоны",
						href: "/",
					},
					{
						label: "Смарт-часы и фитнес-браслеты",
						href: "/",
					},
					{
						label: "Аксессуары для смартфонов и телефонов",
						href: "/",
					},
				],
			},
			{
				label: "Телефоны и смарт-часы",
				href: "/",
				links: [
					{
						label: "Смартфоны",
						href: "/",
					},
					{
						label: "Смарт-часы и фитнес-браслеты",
						href: "/",
					},
					{
						label: "Аксессуары для смартфонов и телефонов",
						href: "/",
					},
				],
			},
		],
	},
	{
		label: "Одежда",
		value: "clothes",
		icon: Shirt,
		href: "/clothes",
		subCategories: [
			{
				label: "Телефоны и смарт-часы",
				href: "/",
				links: [
					{
						label: "Смартфоны",
						href: "/",
					},
					{
						label: "Смарт-часы и фитнес-браслеты",
						href: "/",
					},
					{
						label: "Аксессуары для смартфонов и телефонов",
						href: "/",
					},
				],
			},
			{
				label: "Аудиотехника",
				href: "/",
				links: [
					{
						label: "Наушники и гарнитура",
						href: "/",
					},
					{
						label: "Акустика и колонки",
						href: "/",
					},
					{
						label: "Микрофоны и аксессуары",
						href: "/",
					},
				],
			},
			{
				label: "Фото и видеокамеры",
				href: "/",
				links: [
					{
						label: "Экшн-камеры",
						href: "/",
					},
					{
						label: "Объективы",
						href: "/",
					},
					{
						label: "Видеокамеры и аксессуары",
						href: "/",
					},
				],
			},
			{
				label: "Телефоны и смарт-часы",
				href: "/",
				links: [
					{
						label: "Смартфоны",
						href: "/",
					},
					{
						label: "Смарт-часы и фитнес-браслеты",
						href: "/",
					},
					{
						label: "Аксессуары для смартфонов и телефонов",
						href: "/",
					},
				],
			},
			{
				label: "Телефоны и смарт-часы",
				href: "/",
				links: [
					{
						label: "Смартфоны",
						href: "/",
					},
					{
						label: "Смарт-часы и фитнес-браслеты",
						href: "/",
					},
					{
						label: "Аксессуары для смартфонов и телефонов",
						href: "/",
					},
				],
			},
			{
				label: "Телефоны и смарт-часы",
				href: "/",
				links: [
					{
						label: "Смартфоны",
						href: "/",
					},
					{
						label: "Смарт-часы и фитнес-браслеты",
						href: "/",
					},
					{
						label: "Аксессуары для смартфонов и телефонов",
						href: "/",
					},
				],
			},
		],
	},
	{
		label: "Обувь",
		value: "shoes",
		icon: Footprints,
		href: "/shoes",
		subCategories: [
			{
				label: "Телефоны и смарт-часы",
				href: "/",
				links: [
					{
						label: "Смартфоны",
						href: "/",
					},
					{
						label: "Смарт-часы и фитнес-браслеты",
						href: "/",
					},
					{
						label: "Аксессуары для смартфонов и телефонов",
						href: "/",
					},
				],
			},
			{
				label: "Аудиотехника",
				href: "/",
				links: [
					{
						label: "Наушники и гарнитура",
						href: "/",
					},
					{
						label: "Акустика и колонки",
						href: "/",
					},
					{
						label: "Микрофоны и аксессуары",
						href: "/",
					},
				],
			},
			{
				label: "Фото и видеокамеры",
				href: "/",
				links: [
					{
						label: "Экшн-камеры",
						href: "/",
					},
					{
						label: "Объективы",
						href: "/",
					},
					{
						label: "Видеокамеры и аксессуары",
						href: "/",
					},
				],
			},
			{
				label: "Телефоны и смарт-часы",
				href: "/",
				links: [
					{
						label: "Смартфоны",
						href: "/",
					},
					{
						label: "Смарт-часы и фитнес-браслеты",
						href: "/",
					},
					{
						label: "Аксессуары для смартфонов и телефонов",
						href: "/",
					},
				],
			},
			{
				label: "Телефоны и смарт-часы",
				href: "/",
				links: [
					{
						label: "Смартфоны",
						href: "/",
					},
					{
						label: "Смарт-часы и фитнес-браслеты",
						href: "/",
					},
					{
						label: "Аксессуары для смартфонов и телефонов",
						href: "/",
					},
				],
			},
			{
				label: "Телефоны и смарт-часы",
				href: "/",
				links: [
					{
						label: "Смартфоны",
						href: "/",
					},
					{
						label: "Смарт-часы и фитнес-браслеты",
						href: "/",
					},
					{
						label: "Аксессуары для смартфонов и телефонов",
						href: "/",
					},
				],
			},
		],
	},
	{
		label: "Дом и сад",
		value: "house",
		icon: LampCeiling,
		href: "/house",
		subCategories: [
			{
				label: "Телефоны и смарт-часы",
				href: "/",
				links: [
					{
						label: "Смартфоны",
						href: "/",
					},
					{
						label: "Смарт-часы и фитнес-браслеты",
						href: "/",
					},
					{
						label: "Аксессуары для смартфонов и телефонов",
						href: "/",
					},
				],
			},
			{
				label: "Аудиотехника",
				href: "/",
				links: [
					{
						label: "Наушники и гарнитура",
						href: "/",
					},
					{
						label: "Акустика и колонки",
						href: "/",
					},
					{
						label: "Микрофоны и аксессуары",
						href: "/",
					},
				],
			},
			{
				label: "Фото и видеокамеры",
				href: "/",
				links: [
					{
						label: "Экшн-камеры",
						href: "/",
					},
					{
						label: "Объективы",
						href: "/",
					},
					{
						label: "Видеокамеры и аксессуары",
						href: "/",
					},
				],
			},
			{
				label: "Телефоны и смарт-часы",
				href: "/",
				links: [
					{
						label: "Смартфоны",
						href: "/",
					},
					{
						label: "Смарт-часы и фитнес-браслеты",
						href: "/",
					},
					{
						label: "Аксессуары для смартфонов и телефонов",
						href: "/",
					},
				],
			},
			{
				label: "Телефоны и смарт-часы",
				href: "/",
				links: [
					{
						label: "Смартфоны",
						href: "/",
					},
					{
						label: "Смарт-часы и фитнес-браслеты",
						href: "/",
					},
					{
						label: "Аксессуары для смартфонов и телефонов",
						href: "/",
					},
				],
			},
			{
				label: "Телефоны и смарт-часы",
				href: "/",
				links: [
					{
						label: "Смартфоны",
						href: "/",
					},
					{
						label: "Смарт-часы и фитнес-браслеты",
						href: "/",
					},
					{
						label: "Аксессуары для смартфонов и телефонов",
						href: "/",
					},
				],
			},
		],
	},
	{
		label: "Бытовая техника",
		value: "bytovia",
		icon: Home,
		href: "/bytovia",
		subCategories: [
			{
				label: "Телефоны и смарт-часы",
				href: "/",
				links: [
					{
						label: "Смартфоны",
						href: "/",
					},
					{
						label: "Смарт-часы и фитнес-браслеты",
						href: "/",
					},
					{
						label: "Аксессуары для смартфонов и телефонов",
						href: "/",
					},
				],
			},
			{
				label: "Аудиотехника",
				href: "/",
				links: [
					{
						label: "Наушники и гарнитура",
						href: "/",
					},
					{
						label: "Акустика и колонки",
						href: "/",
					},
					{
						label: "Микрофоны и аксессуары",
						href: "/",
					},
				],
			},
			{
				label: "Фото и видеокамеры",
				href: "/",
				links: [
					{
						label: "Экшн-камеры",
						href: "/",
					},
					{
						label: "Объективы",
						href: "/",
					},
					{
						label: "Видеокамеры и аксессуары",
						href: "/",
					},
				],
			},
			{
				label: "Телефоны и смарт-часы",
				href: "/",
				links: [
					{
						label: "Смартфоны",
						href: "/",
					},
					{
						label: "Смарт-часы и фитнес-браслеты",
						href: "/",
					},
					{
						label: "Аксессуары для смартфонов и телефонов",
						href: "/",
					},
				],
			},
			{
				label: "Телефоны и смарт-часы",
				href: "/",
				links: [
					{
						label: "Смартфоны",
						href: "/",
					},
					{
						label: "Смарт-часы и фитнес-браслеты",
						href: "/",
					},
					{
						label: "Аксессуары для смартфонов и телефонов",
						href: "/",
					},
				],
			},
			{
				label: "Телефоны и смарт-часы",
				href: "/",
				links: [
					{
						label: "Смартфоны",
						href: "/",
					},
					{
						label: "Смарт-часы и фитнес-браслеты",
						href: "/",
					},
					{
						label: "Аксессуары для смартфонов и телефонов",
						href: "/",
					},
				],
			},
		],
	},
];
